
Функция PingGETPing(Запрос) 
	
	Возврат ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();  
	
КонецФункции

Функция SendPOSTSend(Запрос)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		//Ответ = ОбщегоНазначенияHTTP.ПростойУспешныйОтвет(); 
		Ответ = Телеграм.ОбработатьВходящийЗапрос(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос, Ответ); 
	
	Возврат Ответ;
	
	
КонецФункции
