
&НаКлиенте
Процедура ПолучитьПогоду(Команда)
	ПолучитьПогодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПогодуНаСервере()
	
	Соединение = Новый HTTPСоединение("api.weather.yandex.ru",443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	АдресРесурса = "v2/informers?lat=64.534024&lon=40.563087";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Yandex-API-Key", "f55b3b5f-764a-49cf-819f-f0a63b5f1eef");
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Код состояния не равен 200";
	КонецЕсли;   
	
	ДанныеЗапроса = Телеграм.ДанныеЗапроса(Ответ);

	Температура = ДанныеЗапроса.fact.temp;
	ОписаниеПогоды = ДанныеЗапроса.fact.condition; 
	Ветер = ДанныеЗапроса.fact.wind_speed;
	Влажность = ДанныеЗапроса.fact.humidity; 
	
	Если ОписаниеПогоды = "clear" Тогда
		ОписаниеПогоды = "ясно";
	ИначеЕсли ОписаниеПогоды = "partly-cloudy" Тогда
		ОписаниеПогоды = "малооблачно";
	ИначеЕсли ОписаниеПогоды = "cloudy" Тогда
		ОписаниеПогоды = "облачно с прояснениями";
	ИначеЕсли ОписаниеПогоды = "overcast" Тогда
		ОписаниеПогоды = "пасмурно";
	ИначеЕсли ОписаниеПогоды = "drizzle" Тогда
		ОписаниеПогоды = "морось";
	ИначеЕсли ОписаниеПогоды = "light-rain" Тогда
		ОписаниеПогоды = "небольшой дождь";
	ИначеЕсли ОписаниеПогоды = "rain" Тогда
		ОписаниеПогоды = "дождь";
	ИначеЕсли ОписаниеПогоды = "moderate-rain" Тогда
		ОписаниеПогоды = "умеренно сильный дождь";
	ИначеЕсли ОписаниеПогоды = "heavy-rain" Тогда
		ОписаниеПогоды = "сильный дождь";
	ИначеЕсли ОписаниеПогоды = "continuous-heavy-rain" Тогда
		ОписаниеПогоды = "длительный сильный дождь";
	ИначеЕсли ОписаниеПогоды = "showers" Тогда
		ОписаниеПогоды = "ливень";
	ИначеЕсли ОписаниеПогоды = "wet-snow" Тогда
		ОписаниеПогоды = "дождь со снегом";
	ИначеЕсли ОписаниеПогоды = "light-snow" Тогда
		ОписаниеПогоды = "небольшой снег";
	ИначеЕсли ОписаниеПогоды = "snow" Тогда
		ОписаниеПогоды = "снег";
	ИначеЕсли ОписаниеПогоды = "snow-showers" Тогда
		ОписаниеПогоды = "снегопад";
	ИначеЕсли ОписаниеПогоды = "hail" Тогда
		ОписаниеПогоды = "град";
	ИначеЕсли ОписаниеПогоды = "thunderstorm" Тогда
		ОписаниеПогоды = "гроза";
	ИначеЕсли ОписаниеПогоды = "thunderstorm-with-rain" Тогда
		ОписаниеПогоды = "дождь с грозой";
	Иначе
		ОписаниеПогоды = "гроза с градом";
	КонецЕсли;		
	 		
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,, 10,Новый ЗащищенноеСоединениеOpenSSL);
	
	ИдентификаторЧата = Константы.ИдентификаторЧата.Получить();
	Токен = Константы.Токен.Получить();
	ТекстСообщения = "Сейчас " + ОписаниеПогоды + ". " + "Температура возудуха составляет: " + Температура + " °C. " + "Влажность воздуха: " + Влажность + " %. " + "Скорость ветра: " + Ветер + " м/с."; 
	
	АдресРесурса = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", Токен, ИдентификаторЧата, ТекстСообщения);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	
	Ответ = Соединение.Получить(Запрос);
	
КонецПроцедуры

&НаКлиенте
Процедура НапоминаниеОбОтчёте(Команда)
	НапоминаниеОбОтчётеНаСервере();
КонецПроцедуры

&НаСервере
Процедура НапоминаниеОбОтчётеНаСервере()
	
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,, 10,Новый ЗащищенноеСоединениеOpenSSL);
	
	ИдентификаторЧата = Константы.ИдентификаторЧата.Получить();
	Токен = Константы.Токен.Получить();
	ТекстСообщения = "Напоминание: Оформите, пожалуйста, отчёт за день.";
	
	АдресРесурса = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", Токен, ИдентификаторЧата, ТекстСообщения);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	
	Ответ = Соединение.Получить(Запрос); 		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛоги(Команда)
	ОткрытьФорму("Документ.ВходящийHTTPЗапрос.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользователей(Команда)
	ОткрытьФорму("Справочник.УчетныеЗаписиТелеграм.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Токен(Команда)
	ОткрытьФорму("Константа.Токен.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура Идентификатор(Команда)
	ОткрытьФорму("Константа.ИдентификаторЧата.ФормаКонстант");
КонецПроцедуры

