
Функция ОбработатьВходящийЗапрос(Запрос) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос); 
	
	Если ДанныеЗапроса.Свойство("message") Тогда 
		Возврат ОбработатьСообщение(ДанныеЗапроса.message);	
	КонецЕсли;
	
	Если ДанныеЗапроса.Свойство("callback_query") Тогда
		Возврат ОбработатьНажатиеКнопки(ДанныеЗапроса.callback_query);  
	КонецЕсли;
		
	Возврат ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
	
			
КонецФункции  

Функция ОбработатьНажатиеКнопки(ДанныеКнопки) Экспорт
	
	Если ДанныеКнопки.Свойство("from") Тогда
		
		ЗафиксироватьОтправителя(ДанныеКнопки.from);
		
	КонецЕсли;
	
	ИдентификаторЧата = ДанныеКнопки.message.chat.id;
	//ИдентификаторЧата = "901555837"; 
	
	Если ДанныеКнопки.data = "gifka" Тогда
		//ПутьКФайлу = "C:\bot_files\ytka.gif";
		ПутьКФайлу = БиблиотекаКартинок.ytka.ПолучитьДвоичныеДанные();
	ИначеЕсли ДанныеКнопки.data = "otkritka" Тогда
		//ПутьКФайлу = "C:\bot_files\otkritka.gif";
		ПутьКФайлу = БиблиотекаКартинок.otkritka.ПолучитьДвоичныеДанные();
	Иначе 
		//ПутьКФайлу = "C:\bot_files\romashka.jpg";
		ПутьКФайлу = БиблиотекаКартинок.romashka.ПолучитьДвоичныеДанные();
	КонецЕсли;		
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());
 
	//ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлу);
	ДанныеФайла = ПутьКФайлу;
	Поток = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(Поток);
	
	//НачальныеДанные ЧАТID
	ЗаписьДанных.ЗаписатьСтроку("--" + Boundary);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""chat_id""");
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.ЗаписатьСтроку(XMLСтрока(ИдентификаторЧата));
	
	//НачальныеДанные Метод
	ЗаписьДанных.ЗаписатьСтроку("--" + Boundary);
	ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""method""");
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.ЗаписатьСтроку("sendAnimation");
	
	//НачальныеДанные Файл
	ЗаписьДанных.ЗаписатьСтроку("--" + Boundary); 
	Если ПутьКФайлу = БиблиотекаКартинок.ytka.ПолучитьДвоичныеДанные() Тогда 
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""animation""; filename=""ytka.gif""");
	ИначеЕсли ПутьКФайлу = БиблиотекаКартинок.otkritka.ПолучитьДвоичныеДанные() Тогда
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""animation""; filename=""otkritka.gif""");		
	Иначе
		ЗаписьДанных.ЗаписатьСтроку("Content-Disposition: form-data; name=""animation""; filename=""romashka.jpg""");
	КонецЕсли;			
	ЗаписьДанных.ЗаписатьСтроку("");
	
	//ДанныеФайла	
	ЗаписьДанных.Записать(ДанныеФайла);
	
	//КонечныеДанные
	ЗаписьДанных.ЗаписатьСтроку("");
	ЗаписьДанных.ЗаписатьСтроку("--" + Boundary + "--");
	
	ЗаписьДанных.Закрыть();
	
	Тело = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		
	Возврат ОбщегоНазначенияHTTP.ОтветJSON(Тело, Boundary);	
	
КонецФункции   

Функция ОбработатьСообщение(ДанныеСообщения)
	
	Если ДанныеСообщения.Свойство("from") Тогда
		
		ЗафиксироватьОтправителя(ДанныеСообщения.from);
		
	КонецЕсли;
	
	ИдентификаторЧата = ДанныеСообщения.chat.id;
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method", "sendMessage");
	ДанныеОтвета.Вставить("chat_id", ИдентификаторЧата); 
	
	ВремяОтчёта = НачалоДня(ТекущаяДата()) + 60*60*10;
	ВремяОкончанияОтчёта = НачалоДня(ТекущаяДата()) + 60*60*10 + 60*15;
	ПериодДоОкончания = (ВремяОкончанияОтчёта - ТекущаяДата());
		
	Если ТекущаяДата() >= ВремяОтчёта И ТекущаяДата() <= ВремяОкончанияОтчёта Тогда
		
		ТекстСообщения = "Для начала оформите, пожалуйста, отчёт за день. Жду Вас через " + ПериодДоОкончания + " c";
		ДанныеОтвета.Вставить("text", ТекстСообщения)
		
	Иначе
		
		Клавиатура = ПолучитьКлавиатуру();
		ТекстСообщения = "Чего желаете?";
		ДанныеОтвета.Вставить("text", ТекстСообщения);
		ДанныеОтвета.Вставить("reply_markup", Клавиатура);
		
	КонецЕсли;
			
	
	Возврат ОбщегоНазначенияHTTP.ОтветJSON(ДанныеОтвета);
			
КонецФункции

Функция ПолучитьКлавиатуру() 
	
		Строки = Новый Массив;
		Кнопки = Новый Массив;
		Кнопки.Добавить(Новый Структура("text,callback_data", "Картинка с ромашкой", "kartinka")); 
		Кнопки.Добавить(Новый Структура("text,callback_data", "Гифка с уткой", "gifka")); 
		Кнопки.Добавить(Новый Структура("text,callback_data", "Открытка", "otkritka"));

		Строки.Добавить(Кнопки);
		
		КлавиатураВСообщении = ОбщегоНазначенияHTTP.СтрокаJSON(Новый Структура("inline_keyboard", Строки));
		
		Возврат КлавиатураВСообщении;
	
КонецФункции

Функция ДанныеЗапроса(Запрос) Экспорт
	
	ТелоЗапроса =  Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбщегоНазначенияHTTP.ОбъектJSON(ТелоЗапроса);
	
	
КонецФункции

Процедура ЗафиксироватьОтправителя(ДанныеОтправителя)
	
	Идентификатор = ДанныеОтправителя.id;
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиТелеграм.НайтиПоКоду(Идентификатор);
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиИмениПользователя = Новый Массив;
	
	Если ДанныеОтправителя.Свойство("first_name") Тогда 
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.first_name);
	КонецЕсли; 
	
	Если ДанныеОтправителя.Свойство("last_name") Тогда 
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.last_name);
	КонецЕсли; 
	
	Если ДанныеОтправителя.Свойство("username") Тогда 
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.username);
	КонецЕсли; 
	
	ИмяПользователя = СтрСоединить(ЧастиИмениПользователя, " ");
	
	СпрОбъект = Справочники.УчетныеЗаписиТелеграм.СоздатьЭлемент();
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Код = Идентификатор;
	СпрОбъект.Записать();
	
	
КонецПроцедуры